Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་ང་འདི་སྙམ་དུ་སེམས་ཏེ། གང་རིགས་ཀྱི་བུ་དེ་དག་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པ། དགེ་བའི་ཆོས་ཅན། རང་བཞིན་གྱིས་འདོད་ཆགས་ཆུང་བ། ཞེ་སྡང་ཆུང་བ། གཏི་མུག་ཆུང་བ་སྟེ། བདག་ནི་དེ་དག་ཉི་ཚེའི་དོན་དུ་དཀའ་བ་སྤྱོད་པ་མ་ཡིན། དེ་དག་ཉི་ཚེའི་དོན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་པ་མ་ཡིན་གྱི། སེམས་ཅན་གང་དམུ་རྒོད་གདུལ་དཀའ་བ། ཚུལ་ཁྲིམས་འཆལ་བ། སྡིག་པའི་ཆོས་ཅན། རང་བཞིན་གྱིས་འདོད་ཆགས་མང་བ། ཞེ་སྡང་མང་བ། གཏི་མུག་མང་བ། དེ་དག་གི་དོན་དུ་བདག་དཀའ་བ་སྤྱད་པ་སྤྱོད། དེ་དག་གི་དོན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་སྟེ། དེ་དག་ཉིད་བདག་གི་ཐོག་མར་མྱ་ངན་ལས་བཟླ་བར་བྱའོ། ། ཤཱ་རིའི་བུ་སེམས་སྡང་བ་མེད་པ་ལ་དྲན་པ་འདི་སྐྱེས་སོ། །
en: “At that time I would think, ‘It is not only for the sake of those sons of good family who are moral and whose character is virtuous, whose nature it is to have little desire, little anger, and little confusion, that I will attain unsurpassed perfect awakening. Rather, it is for the sake of those sentient beings who are unruly, undisciplined, and immoral, whose character is evil and whose nature it is to experience much desire, much anger, and much confusion, that I will attain unsurpassed perfect awakening. It is these beings, first and foremost, who I will help toward nirvāṇa.’ Śāriputra, this was the attitude of nonaggression that I kept in mind at that time.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཕན་པའི་དངོས་པོ་ཕུན་སུམ་ཚོགས་པ་སྟེ། སྔོན་གྱི་མཐའ་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་འོངས་པའོ། །
en: This, Śāriputra, is how the Tathāgata perfected his abilities of helpfulness as he pursued the practice of the way of the bodhisatva in the past.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་འདོད་པ་དེ་དག་གིས་བཟོད་པ་དང་ལྡན་ཞིང་དང་དུ་ལེན་པའི་རང་བཞིན་ཅན་དུ་བྱའོ། ། གྲང་བ་དང་། ཚ་བ་དང་། བཀྲེས་པ་དང་སྐོམ་པ་དང་། རླུང་དང་། ཉི་མ་དང་། སྦྲང་བུ་དང་། ཤ་སྦྲང་དང་། སྡིག་སྦྲུལ་གྱིས་རེག་པ་དང་། ཕ་རོལ་གྱིས་ངན་དུ་སྨྲ་བ་དང་། ངན་དུ་བརྗོད་པའི་ཚིག་གི་ལམ་རྣམས་ལ་བཟོད་པ་དང་ལྡན་ཞིང་དང་དུ་ལེན་པའི་རང་བཞིན་ཅན་དུ་བྱའོ། །ལུས་ལས་སྐྱེས་ཤིང་བྱུང་བའི་ཚོར་བ་སྡུག་བསྔལ་བ། མི་བཟད་པ། རྩུབ་པ། སྲོག་འཕྲོག་པ། འཆི་བ་ལ་ཐུག་པའི་ཚོར་བ་རྣམས་ལ་བཟོད་པ་དང་ལྡན་ཞིང་དང་དུ་ལེན་པའི་རང་བཞིན་ཅན་དུ་བྱའོ། །
en: “Śāriputra, any bodhisatva who aspires to attain unsurpassed perfect awakening must master patient acceptance and have a natural ability for endurance. He must be patient with and have a natural ability to endure cold and heat, starvation and thirst, wind and scorching heat, insects and reptiles, and people speaking to him in unpleasant and unwelcome ways. He must be patient with and have a natural ability to endure painful sensations that are related to or produced by the physical body, whether they are intense, strong, sharp, life threatening, or deadly.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་བཟོད་པ་དེ་ལྟ་བུ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ། ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་གང་ཞེ་ན། གནོད་སེམས་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། མི་ཁྲོ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། མི་འཚེ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། རྩོད་པ་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། གནོད་པར་བྱ་བ་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། བདག་རྗེས་སུ་སྲུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། གཞན་རྗེས་སུ་སྲུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། ལུས་རྗེས་སུ་སྲུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། ངག་རྗེས་སུ་སྲུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། སེམས་རྗེས་སུ་སྲུང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། ཚུལ་བཞིན་གྱིས་སོ་སོར་རྟོག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། མྱ་ངན་ལས་འདས་པ་འདོད་ཆགས་དང་བྲལ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། ལུས་ཡོངས་སུ་དག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། ངག་ཡོངས་སུ་དག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། སེམས་ཡོངས་སུ་དག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་རྗེས་སུ་མྱོང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། དེ་བཞིན་གཤེགས་པའི་གསུང་ཚངས་པའི་སྒྲ་དབྱངས་བསྒྲགས་པ་འཐོབ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཆུད་མི་གཟོན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། ཕས་ཀྱི་གནོད་པར་བྱེད་པ་ཐམས་ཅད་ལས་འདས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། ། ཕྱིར་རྒོལ་བ་ཐམས་ཅད་བཅོམ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། མདོར་ན་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། མ་འདྲེས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། བྱམས་པ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པར་བལྟའོ། །
en: “Thus, Śāriputra, the bodhisatva who comes to master such patient acceptance achieves ‘bodhisatva patience.’ What is bodhisatva patience? The absence of malice is a sign of bodhisatva patience. The absence of anger is a sign of bodhisatva patience. Nonviolence is a sign of bodhisatva patience. The absence of disputes is a sign of bodhisatva patience. The absence of aggression is a sign of bodhisatva patience. Guarding oneself is a sign of bodhisatva patience. Guarding others is a sign of bodhisatva patience. Guarding one’s body is a sign of bodhisatva patience. Guarding one’s speech is a sign of bodhisatva patience. Guarding one’s mind is a sign of bodhisatva patience. Investigating everything thoroughly is a sign of bodhisatva patience. Not wishing for nirvāṇa is a sign of bodhisatva patience. Accepting the ripening of the fruits of previous actions is a sign of bodhisatva patience. Being physically pure is a sign of bodhisatva patience. Being verbally pure is a sign of bodhisatva patience. Being mentally pure is a sign of bodhisatva patience. Experiencing the excellent states of a god or a human being is a sign of bodhisatva patience. Coming to possess the major and minor marks of a tathāgata is a sign of bodhisatva patience. The attainment of the resounding speech of a tathāgata and the voice of Brahmā is a sign of bodhisatva patience. Following the way of the bodhisatva and never allowing one’s roots of virtue to perish is a sign of bodhisatva patience. Being beyond any attack from others is a sign of bodhisatva patience. Delighting in setting one’s opponents on the right path is a sign of bodhisatva patience. In short, possessing the powers, confidence, unique qualities, great compassion, great love, great empathetic joy, and great equanimity of a tathāgata and being replete with all the characteristics of a buddha is a sign of bodhisatva patience.

source: ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་བྲག་ཅའི་སྒྲ་དང་མཚུངས་པར་རབ་ཏུ་ཤེས་པས་སྤྱོས་ཀྱང་སླར་མི་གཤེའོ། །ལུས་གཟུགས་བརྙན་དུ་ཤེས་པས་བརྡེགས་ཀྱང་སླར་མི་རྡེག ། སེམས་སྒྱུ་མ་ལྟ་བུར་རབ་ཏུ་རྟོགས་པས་ཁྲོས་ཀྱང་སླར་མི་ཁྲོ། རང་གི་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པས་དེ་མ་བསྔགས་པ་ལ་ཁོང་ཁྲོ་བ་མེད། བསྔགས་པ་ལ་རྗེས་སུ་ཆགས་པར་མི་བྱེད་དོ། ། དུལ་ཞིང་ཞི་བའི་ཕྱིར་རྙེད་པས་དགའ་བར་མི་འགྱུར། མ་རྙེད་པས་ཞུམ་པར་མི་འགྱུར། རབ་ཏུ་བརྟགས་པའི་བློ་རྒྱ་ཆེ་བའི་ཕྱིར་གྲགས་པས་ངོ་མཚར་དུ་མི་འཛིན། མ་གྲགས་པས་འཁྲུལ་བར་མི་འགྱུར། མི་གཡོ་བར་རབ་ཏུ་གནས་པའི་ཕྱིར་སྨད་པས་འདུད་པར་མི་འགྱུར། བསྟོད་པས་ཁེངས་པར་མི་འགྱུར། སེམས་ཅན་ལ་ལྟ་བའི་ཕྱིར་སྡུག་བསྔལ་གྱིས་ཡོངས་སུ་མི་སྐྱོ། འདུས་བྱས་ཀྱི་བདེ་བ་མི་རྟག་པའི་ཕྱིར། བདེ་བ་ལ་དགའ་བ་མེད། སྲིད་པའི་འགྲོ་བར་སྐྱེ་བ་ཐམས་ཅད་ལ་མི་གནས་པས་འཇིག་རྟེན་གྱི་ཆོས་ཀྱིས་མི་གོས་ཕ་རོལ་ལ་མི་གནོད་པས་བདག་ལ་གནོད་པ་བཟོད། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚོགས་ཡོངས་སུ་རྫོགས་པས་ཡན་ལག་དང་། ཉིང་ལག་དང་། མགོ་བཅད་ཀྱང་བཟོད། སངས་རྒྱས་ཀྱི་སྐུ་འདོད་པས་ལུས་གཏུབས་ཀྱང་བཟོད། ལེགས་པར་བྱས་པའི་ལས་ཀྱི་སྟོབས་བསྐྱེད་པས་ངན་དུ་བྱས་པ་ཐམས་ཅད་བཟོད་དེ། ཤཱ་རིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཞེས་བྱའོ། །
en: “Śāriputra, because of this bodhisatva patience, he truly understands that any outburst is just like an echo and will not retort when he is verbally abused. He sees the body as being like a reflection and will not strike back when he is struck. He understands that the mind is like an illusion and will not become angered, even when others are angry. He knows his own level of achievement and is neither downcast if he is not praised nor flattered if he is complimented. He is disciplined and tranquil and is neither exhilarated by gain nor depressed by loss. He sees the bigger picture and is neither fascinated by fame nor troubled by anonymity. He is firm and unshakeable and is neither bowed by blame nor elated by praise. His focus is sentient beings, and so suffering does not trouble him. As conditioned happiness is impermanent, he does not allow himself to become intoxicated by happiness. He is beyond any type of birth and is therefore untarnished by worldly matters. As he does not cause others any agony, he is able to bear the agony that befalls him. As he possesses all the factors of awakening in their fullness, he can bear it when his major and minor limbs and his head are chopped off. As his goal is the buddha body, he can bear it when his body is cut to pieces. He is able to patiently bear any difficulties, as it is this that provides one with the power of having acted in positive ways. This, Śāriputra, is what is called bodhisatva patience.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཞེས་བྱ་བ་ནི། འདི་ལྟ་སྟེ། རབ་ཏུ་བཟོད་པའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གཤེ་བ་ནི་སུ། གཤེ་བར་བྱ་བ་ནི་གང་ཞེས་བཟོད་ན་དེ་གཉི་ག་དམིགས་པའི་བཟོད་པ་སྟེ། དེ་རབ་ཏུ་བཟོད་པ་མ་ཡིན་ནོ། །ཡང་འདི་ལ་གཤེ་བ་གང་ཞེས་བཟོད་ན་དེ་ཆོས་བགྲང་བའི་བཟོད་པ་སྟེ། དེ་རབ་ཏུ་བཟོད་པ་མ་ཡིན་ནོ། ། ཅི་མིག་གིས་མིག་ལ་གཤེའམ་ཞེས་བཟོད་ན་དེ་སྐྱེ་མཆེད་ལ་སོ་སོར་རྟོག་པའི་བཟོད་པ་སྟེ། དེ་རབ་ཏུ་བཟོད་པ་མ་ཡིན་ནོ། །འདི་ནི་ཡི་གེ་ཡིན་ནོ་ཞེས་བཟོད་ན།. དེ་བྲག་ཅའི་སྒྲའི་བཟོད་པ་སྟེ། དེ་རབ་ཏུ་བཟོད་པ་མ་ཡིན་ནོ། ། འདི་ཡང་མི་རྟག །བདག་ཀྱང་མི་རྟག་ཅེས་བཟོད་ན་དེ་མི་རྟག་པ་ལ་འཇུག་པའི་བཟོད་པ་སྟེ། དེ་རབ་ཏུ་བཟོད་པ་མ་ཡིན་ནོ། ། འདི་ནི་ཕྱིན་ཅི་ལོག ། བདག་ནི་ཕྱིན་ཅི་ལོག་མ་ཡིན་ཞེས་བཟོད་ན་དེ་མཐོན་དམན་གྱི་བཟོད་པ་སྟེ། དེ་རབ་ཏུ་བཟོད་པ་མ་ཡིན་ནོ། ། བདག་ནི་རིགས། འདི་ནི་མི་རིགས་སོ་ཞེས་བཟོད་ན་དེ་རིགས་པ་མ་ཡིན་པའི་བཟོད་པ་སྟེ། དེ་རབ་ཏུ་བཟོད་པ་མ་ཡིན་ནོ། ། བདག་ནི་ལམ་ལ་གནས། ། འདི་ནི་ལམ་ངན་པ་ལ་གནས་ཞེས་བཟོད་ན་དེ་གཉིས་ཀྱི་བཟོད་པ་སྐྱེ་སྟེ། དེ་རབ་ཏུ་བཟོད་པ་མ་ཡིན་ནོ། ། བདག་སྟོང་པ་ཉིད་བཟོད་ཀྱི། བདག་ལྟ་བར་སོང་བ་མི་བཟོད། བདག་མཚན་མ་མེད་པ་བཟོད་ཀྱི། བདག་རྣམ་པར་རྟོག་པ་མི་བཟོད། བདག་སྨོན་པ་མེད་པ་བཟོད་ཀྱི། བདག་སྨོན་པ་མི་བཟོད། བདག་མངོན་པར་འདུ་མི་བྱེད་པ་བཟོད། བདག་མངོན་བར་འདུ་བྱེད་པ་མི་བཟོད། བདག་ཉོན་མོངས་པ་ཟད་པ་བཟོད་ཀྱི། བདག་ཉོན་མོངས་པ་མི་བཟོད། བདག་དགེ་བ་བཟོད་ཀྱི། བདག་མི་དགེ་བ་མི་བཟོད། བདག་ཁ་ན་མ་ཐོ་བ་མེད་པ་བཟོད་ཀྱི། བདག་ཁ་ན་མ་ཐོ་བ་མི་བཟོད། བདག་ཟག་པ་ཟད་པ་བཟོད་ཀྱི། བདག་ཟག་པ་དང་བཅས་པ་མི་བཟོད། བདག་འཇིག་རྟེན་ལས་འདས་པ་བཟོད་ཀྱི། བདག་འཇིག་རྟེན་པ་མི་བཟོད། བདག་རྣམ་པར་བྱང་བ་བཟོད་ཀྱི། བདག་ཀུན་ནས་ཉོན་མོངས་པ་མི་བཟོད། བདག་མྱ་ངན་ལས་འདས་པ་བཟོད་ཀྱི། བདག་འཁོར་བ་མི་བཟོད་ན་དེ་གཉེན་པོས་སྤོང་བའི་བཟོད་པ་སྟེ། རབ་ཏུ་བཟོད་པ་མ་ཡིན་ནོ། །
en: “Moreover, Śāriputra, this bodhisatva patience is limitless patient acceptance. In what way? One can be patient, reflecting, ‘Who is abusing? Who is being abused?’ Patience that involves this sort of duality, though, is not limitless patient acceptance. There is the patience where one asks, ‘Who is abusing here?’ This patience, though, which involves contemplating phenomena, is not limitless patient acceptance. One can be patient, reflecting, ‘Is it the eye that abuses the eye?’ This patience, though, which involves examining the sense fields, is not limitless patient acceptance. One can be patient, observing, ‘There is nothing there to abuse.’ This patience, which does not involve any sentient being, though, is not limitless patient acceptance. One can be patient, observing, ‘The anger is communicated through words.’ This patience, though, which perceives any outburst as being like an echo, is not limitless patient acceptance. One can be patient, observing, ‘That is impermanent and I am impermanent.’ This patience, though, which alights on impermanence, is not limitless patient acceptance. One can be patient, observing, ‘He is mistaken, I am not mistaken.’ This kind of patience that belittles others, though, is not limitless patient acceptance. One can be patient, observing, ‘I am doing what is right, he is doing what is wrong.’ This patience that makes distinctions, though, is not limitless patient acceptance. One can be patient, observing, ‘I am on the path. He is on the wrong path.’ This dualistic patience, though, is not limitless patient acceptance. One may think, ‘I can be patient with emptiness, but I have no patience with those who hold views. I can be patient with freedom from attributes, but I have no patience with sophistry. I can be patient with freedom from aspirations, but I have no patience with ambitions. I can be patient with the unconditioned, but I have no patience with the conditioned. I can be patient with the state in which the vices have been eliminated, but I have no patience with vices. I can be patient with wholesomeness, but I have no patience with what is unwholesome. I can be patient with the irreproachable, but I have no patience with the reproachable. I can be patient with the undefiled, but I have no patience with the defiled. I can be patient with the transcendent, but I have no patience with worldly things. I can be patient with the state of purification, but I have no patience with the state of corruption. I can be patient with nirvāṇa, but I have no patience with cyclic existence.’ This sort of patience, though, where one avoids that which is disagreeable, is not limitless patient acceptance.

source: དེ་ལ་རབ་ཏུ་བཟོད་པ་གང་ཞེ་ན། གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པ་དེ་ལ་ལྟ་བ་བསལ་བ་ཡང་མེད། སྟོང་པ་ཉིད་དུ་སྒྲོ་འདོགས་པ་ཡང་མེད། གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པ་དེ་ལ་རྣམ་པར་རྟོག་པ་བསལ་བ་ཡང་མེད། མཚན་མ་མེད་པའི་སྒྲོ་འདོགས་པ་ཡང་མེད། གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པ་དེ་ལ་སྨོན་ལམ་བསལ་བ་ཡང་མེད། སྨོན་པ་མེད་པར་སྒྲོ་འདོགས་པ་ཡང་མེད། གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པ་དེ་ལ་མངོན་པར་འདུ་བྱེད་པ་བསལ་བ་ཡང་མེད། མངོན་པར་འདུ་མི་བྱེད་པར་སྒྲོ་འདོགས་པ་ཡང་མེད། གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པ་དེ་ལ་ཉོན་མོངས་པ་བསལ་བ་ཡང་མེད། ཀུན་ནས་ཉོན་མོངས་པ་ཟད་པར་སྒྲོ་འདོགས་པ་ཡང་མེད། གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པ་དེ་ལ་མི་དགེ་བ་བསལ་བ་ཡང་མེད། དགེ་བར་སྒྲོ་འདོགས་པ་ཡང་མེད། གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པ་དེ་ལ་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་བསལ་བ་ཡང་མེད། ཁ་ན་མ་ཐོ་བ་མེད་པའི་སྒྲོ་འདོགས་པ་ཡང་མེད་དེ། གོང་མ་བཞིན་དུ་ཐམས་ཅད་ལ་རྒྱས་པར་བྱ་སྟེ། གང་སྟོང་པ་ཉིད་ཁོང་དུ་ཆུད་པ་དེ་ལ་འཁོར་བ་བསལ་བ་མེད། མྱ་ངན་ལས་འདས་པར་སྒྲོ་འདོགས་པ་ཡང་མེད་དེ། གང་འདི་ལ་བཟོད་པ་དེ་ནི་རབ་ཏུ་བཟོད་པ་ཞེས་བྱའོ། །
en: “What, then, is limitless patient acceptance? It is to understand emptiness while neither discarding views nor attributing emptiness to things. It is to understand emptiness while neither discarding logical investigation nor attributing freedom from attributes to things. It is to understand emptiness while neither discarding ambitions nor attributing freedom from aspirations to things. It is to understand emptiness while neither discarding the conditioned nor attributing unconditionality to things. It is to understand emptiness while neither discarding the vices nor attributing the elimination of corruption to things. It is to understand emptiness while neither discarding the unwholesome nor attributing wholesomeness to things. It is to understand emptiness while neither discarding the reproachable nor attributing the quality of being irreproachable to things, and so forth; one may here supplement all the elaborations found above. It is to understand emptiness while neither discarding cyclic existence nor attributing nirvāṇa to anything. Patience in this manner is called limitless patient acceptance.

source: གང་མ་སྐྱེས། མ་བསྐྱེད། མ་བྱུང་། བྱུང་བར་མ་གྱུར་པ་དེ་ལ་འབྱུང་བ་གང་ཡང་མེད་དོ། །འབྱུང་བ་མེད་པས་མི་ཟད་དེ། གང་མི་ཟད་པ་དེ་རབ་ཏུ་བཟོད་པའོ། །
en: “That which is unborn, which is not created, which has not arisen, and which does not take place cannot have any sort of existence. As it does not exist, it cannot perish. That which is imperishable is limitless patient acceptance.

source: གང་འདུས་བྱས་ཀྱང་མ་ཡིན། འདུས་མ་བྱས་ཀྱང་མ་ཡིན། སྒྲོ་འདོགས་པ་ཡང་མ་ཡིན། མ་བཞག་པ། མ་སྤེལ་བ། ཡང་དག་པར་མ་སྤེལ་བ། མི་སོགས་པ། མི་འབྲི་བ་དེ་ལ་སྐྱེ་བ་གང་ཡང་མེད་དོ། ། གང་མི་སྐྱེ་བ་དེ་ནི་མི་ཟད་པ་སྟེ། གང་དེ་ལྟར་བཟོད་ན་དེ་ནི་མི་སྐྱེ་བ་ལ་བཟོད་པ་ཞེས་བྱའོ། །
en: “That which is not conditioned and yet not unconditioned, cannot be subject to attribution, and cannot be located, expanded, increased, accumulated, or reduced is not something to which one can attribute arising. That which does not arise is imperishable. One who is patient in this way is said to possess the patient acceptance of nonarising.

source: ཤཱ་རིའི་བུ་བཟོད་པ་འདི་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། ། ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམས་ཀྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། འདི་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དེ། བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་། དེ་མ་ཡིན་པ་ཕས་ཀྱི་རྒོལ་བ་གཞན་ཐམས་ཅད་ཀྱིས་མི་ཐུལ་བ་ཡིན་ནོ། །
en: “This is the kind of patient acceptance, Śāriputra, by means of which the bodhisatva, the great being, practices the way of the bodhisatva. When bodhisatvas, great beings, apply themselves to this in their practice of the way of the bodhisatva, they cannot be overpowered by Māra and his retinue, nor by the gods. They cannot be overpowered by any opponent.”

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ་ཞེས་བྱ་སྟེ། བརྒྱད་པའོ།། །།
en: This is the eighth chapter, “The Perfection of Patient Acceptance.”

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ལ་ཞུགས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་བདུད་དང་བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་། དེ་མ་ཡིན་པ་གཞན་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་ཐུལ་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན།
en: “Now, Śāriputra, what is the bodhisatvas’ perfection of vigor like, the perfection of vigor by means of which bodhisatvas, great beings, practice the way of the bodhisatva and that makes bodhisatvas, great beings, invulnerable to attacks by Māra and his retinue, the gods, and all other opponents?

source: འདི་ལྟར་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན་ཏེ། རང་གི་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་བརྩོན་འགྲུས་དྲག་པོ་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡོངས་སུ་ཚོལ་བར་བྱེད། ཤིན་ཏུ་ཉན་པར་བྱེད། འཆང་བར་བྱེད། འཛིན་པར་བྱེད། ཀློག་པར་བྱེད། ཀུན་ཆུབ་པར་བྱེད། གཞན་ལ་འཆད་པར་བྱེད། རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བྱེད། བྲིས་ནས་འཛིན་པར་བྱེད་དོ། །
en: “Śāriputra, the vigor of the bodhisatva, the great being, is unyielding and involves no concern for his body or his life. When he has cultivated this powerful vigor, he will seek out the cycle of teachings contained in The Collected Teachings on the Bodhisatva. He will study it conscientiously, learn it, memorize it, recite it, absorb it, clarify it for others, teach it in great detail, commit it to writing, and preserve it.

source: དེ་ཇི་ལྟར་ན་ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་ཡིན་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟ་བུའི་མདོ་སྡེ་འཆང་བ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་ལ་ཡང་གོ་བར་བྱེད་པ་དང་། རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དང་། བྲིས་ནས་འཛིན་པ་དང་། དེ་བཞིན་དུ་ནན་ཏན་བྱེད་པ་དེ་དག་གི་ལུས་ལ་ངས་མདའ་དང་། མཚོན་དང་མདུང་ཐུང་བརྒྱས་ཕུག་སྟེ། སྲོག་བཅད་དོ་ཞེས་ཕ་རོལ་གྱིས་བསྡིགས་ཀྱང་དེ་ལ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མི་འཇིགས། མི་དང་ང་། མི་སྐྲག ། ཀུན་ཏུ་སྐྲག་པར་མི་འགྱུར་གྱི། ཕྱིར་ཞིང་བརྩོན་འགྲུས་བརྟན་པ་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་མི་སྤོང་། རྣམ་པར་མི་སྤོང་། རབ་ཏུ་རྣམ་པར་མི་སྤོང་མི་འདོར་ཏེ། མོས་པ་དྲག་པོར་འགྱུར། མོས་པ་བརྟན་པར་འགྱུར། བཟོད་པ་བརྟན་པར་འགྱུར། བརྩོན་འགྲུས་བརྟན་པར་འགྱུར་རོ། །
en: “In what sense does he not have any concern for his body or his life? Śāriputra, even if he is threatened, the bodhisatva will continue his studies of these teachings. He will continue to memorize them, recite them, and absorb them, clarify them for others, teach them in great detail, commit them to writing, and preserve them. He will continue in these pursuits with diligence, even if someone says to him, ‘We are going to ravage your body with a hundred arrows, swords, and spears and rob you of your life.’ Even then, the bodhisatva will not become afraid, alarmed, frightened, or intimidated at all but will bring forth firm vigor, and with strong conviction, he will never damage, sabotage, or abandon the cycle of teachings contained in The Collected Teachings on the Bodhisatva. His resolve is firm. His patience is firm. His vigor is firm.

source: ཤཱ་རིའི་བུ་བཟོད་པ་བརྟན་པ་དང་། བརྩོན་འགྲུས་བརྟན་པ་ལས་བཟུང་སྟེ། དཔེ་བསྟན་ཏོ། ། བཟོད་པ་བརྟན་པ་ཇི་ཙམ་པ་དང་། བརྩོན་འགྲུས་བརྟན་པ་ཇི་ཙམ་པས་བྱང་ཆུབ་སེམས་དཔའ་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་འགྱུར་ཏེ། ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་སྒོ་ང་ལས་སྐྱེས་པའམ། མངལ་ནས་སྐྱེས་པའམ། དྲོད་གཤེར་ལས་སྐྱེས་པའམ། རྫུས་ཏེ་ སྐྱེས་པའམ། གཟུགས་ཅན་ནམ། གཟུགས་མེད་པའམ། འདུ་ཤེས་ཅན་ནམ། འདུ་ཤེས་མེད་པའམ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་ནམ། སྣང་བར་གྱུར་པའམ། མི་སྣང་བར་གྱུར་པ་འམ། སེམས་ཅན་ཇི་སྙེད་སེམས་ཅན་དུ་བསྡུ་བར་བསྡུས་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ལ་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ། དེ་དག་མིར་གྱུར་ནས་ ཐམས་ཅད་ཀྱི་ལག་ན་མཚོན་རྣོན་པོ་ཐོགས་ཏེ་ དགྲར་གྱུར་ནས་ དེ་དག་ཚིག་འདི་སྐད་ཅེས་འདི་ལྟ་བུའི་ཚིག་དང་། ཡི་གེ་འཆང་བ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། གཞན་དག་ལ་འཆད་པ་དང་། རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དང་། དེ་བཞིན་དུ་ནན་ཏན་བྱེད་པ་དེ་དག་ངེད་ཀྱིས་བཟུང་སྟེ། སྲོག་གཅད་དོ་ཞེས་ཟེར་ན་ ཡང་དེ་ལ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དངང་བ་དང་། སྐྲག་པ་སྐྱེ་བའི་སེམས་གཅིག་ཀྱང་མི་སྐྱེད་ཀྱི། དེ་བས་ལྷག་པར་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་འགྱུར་ཏེ དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་བའི་ཕྱིར་རོ། །
en: “I will give you an example, Śāriputra, to help you understand the firmness of his patience and the firmness of his vigor. So firm is his patience, so firm is his vigor, that the bodhisatva has no concern for his body or his life. Śāriputra, no matter how many sentient beings there may be in the threefold thousand great thousand worlds—those born from an egg, those born from a womb, those born from moisture, those born spontaneously, those with form, those without form, those with perception, those without perception, those with neither perception nor nonperception, the visible and the invisible—however many sentient beings there may be, imagine that they all at some moment, at some point, at some time, sooner or later, were to attain a human existence. Imagine then that, having obtained a human form, they all became his enemies, carrying sharp swords, and saying to him, ‘We will catch anyone who studies these texts with diligence, who memorizes them, recites them, clarifies them to others, and teaches them in great detail. When we catch him, we will take his life.’ Even then, Śāriputra, the bodhisatva would not be afraid even for a moment but would continue to uphold the true teachings and pursue the cycle of teachings contained in The Collected Teachings on the Bodhisatva.
